driver-tests/sqlse/derby/insertwrongtypeJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:insertwrongtypeRequest>
      <sql:param1>abc</sql:param1>
      <sql:param2>234</sql:param2>
      <sql:param3>234</sql:param3>
    </sql:insertwrongtypeRequest>
  </soapenv:Body>
</soapenv:Envelope>